---
kind: method
id: M:Autodesk.Revit.Creation.Application.NewCombinableElementArray
source: html/3a6edf2d-5338-b2cf-d857-a8d9321bdf16.htm
---
# Autodesk.Revit.Creation.Application.NewCombinableElementArray Method

Returns an array that can hold combinable element objects.

## Syntax (C#)
```csharp
public CombinableElementArray NewCombinableElementArray()
```

## Returns
An empty array that can contain any CombinableElement derived objects.